from functions import (
    task1,
    task2,
)


#task 1

"""
1. Напишите код на python, который посчитает и выведет на экран количество единичек и их индексы в массиве:

[-1,  1, -2, -1, -2,  0,  2, -3,  2, -2,  0, -1,  1, -3,  0,  1,  2, -1, -3, -3]

"""

list = [-1,  1, -2, -1, -2,  0,  2, -3,  2, -2,  0, -1,  1, -3,  0,  1,  2, -1, -3, -3]
print(task1(list))

#task 2

"""
2. Дан список (list) цен на iphone xs max 256gb у разных продавцов на hotline:  

[47.999, 42.999, 49.999, 37.245, 38.324, 37.166, 38.988, 37.720]

Средствами python, написать функцию, возвращающую tuple из min, max и mean (среднюю) и median (медианную) цену.

"""

list = [47.999, 42.999, 49.999, 37.245, 38.324, 37.166, 38.988, 37.720]
print(task2(list))
